/******************************************************************Обозначения*********************************************************************************/

//Определяем пины, к которым будем подключать шим-входы контроллера мотора
#define PWM_PIN_1 2     //Подключаем к GP2 - 4 ножка микроконтроллера
#define PWM_PIN_2 3     //Подключаем к GP3 - 5 ножка микроконтроллера
#define PWM_PIN_3 4
#define PWM_PIN_4 5

//Определяем предделитель тактовой частоты микроконтроллера (125Мгц) - один для всех шим-каналов
//#define PWM_DIV 6250
#define PWM_DIV 250
//Определяем число тиковs, через которое таймер будет сброшен. От этого числа будет зависеть точность установки скважности импульсов(чем больше, тем выше точность)
#define PWM_WRAP 10000
//             _____                            _____
//            |     |                          |     |                      1ms - 0 deg
//            |     |                          |     |                      2ms - 180 deg
//____________|     |__________________________|     |______
//             1-2ms
//           (500-1000)                        |
//            |<------------------------------>|
//                            20ms (10000)
/***************************************************************Библиотечные функции***************************************************************************/

void servo_init();
/*
void  motor2_controller(float speed );
void  motor3_controller(float speed );
void  motor4_controller(float speed );
void  motor1_controller(float speed );
*/
void servo(int number, int angle );

